IDEA Open Model
ReinforcedBar Class
Compatible with IDEA StatiCa 20.1
 Reinforced bar
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.ReinforcedBar
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ReinforcedBar : OpenObject
Public Class ReinforcedBar
	Inherits OpenObject
The ReinforcedBar type exposes the following members.
Constructors
Name | Description
ReinforcedBar
Initializes a new instance of the ReinforcedBar class
Top
Properties
Name | Description
Diameter
 Diameter
Material
 Material
Point
 Position of bar
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace